// 1. Реализуйте 1 из вариантов класса Cat из предыдущего задания, 
//можно использовать не все придуманные поля и методы. Создайте 
//несколько экземпляров этого класса, выведите их в консоль.
// 2. Добейтесь того, чтобы при выводе в консоль объекта типа Cat, 
//выводилась его кличка, цвет и возраст (или другие параметры на ваше усмотрение).

package Java.sem.sem6.sem61;

public class Program {
    public static void main(String[] args) {
        Cat cat1 = new Cat();
        cat1.Age = 5;
        cat1.Color = "Рыжий";
        cat1.id = 54543543;
        
    }
}
